{
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v3.1.0",
    "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model",
                "layers": [{ "class_name": "InputLayer", "config": { "batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0" }, "name": "input_0", "inbound_nodes": [] }, {
                    "class_name": "ZeroPadding2D",
                    "config": {
                        "name": "9_pad",
                        "trainable": true,
                        "dtype": "float32",
                        "padding": [
                            [1, 1],
                            [1, 1]
                        ],
                        "data_format": "channels_first"
                    },
                    "name": "9_pad",
                    "inbound_nodes": [
                        [
                            ["input_0", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Conv2D",
                    "config": { "name": "9", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": { "class_name": "Zeros", "config": {} }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null },
                    "name": "9",
                    "inbound_nodes": [
                        [
                            ["9_pad", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Activation",
                    "config": { "name": "10", "trainable": true, "dtype": "float32", "activation": "relu" },
                    "name": "10",
                    "inbound_nodes": [
                        [
                            ["9", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "MaxPooling2D",
                    "config": { "name": "11", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first" },
                    "name": "11",
                    "inbound_nodes": [
                        [
                            ["10", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "ZeroPadding2D",
                    "config": {
                        "name": "12_pad",
                        "trainable": true,
                        "dtype": "float32",
                        "padding": [
                            [1, 1],
                            [1, 1]
                        ],
                        "data_format": "channels_first"
                    },
                    "name": "12_pad",
                    "inbound_nodes": [
                        [
                            ["11", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Conv2D",
                    "config": { "name": "12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": { "class_name": "Zeros", "config": {} }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null },
                    "name": "12",
                    "inbound_nodes": [
                        [
                            ["12_pad", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Activation",
                    "config": { "name": "13", "trainable": true, "dtype": "float32", "activation": "relu" },
                    "name": "13",
                    "inbound_nodes": [
                        [
                            ["12", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Reshape",
                    "config": { "name": "14", "trainable": true, "dtype": "float32", "target_shape": [12544] },
                    "name": "14",
                    "inbound_nodes": [
                        [
                            ["13", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Dense",
                    "config": { "name": "15", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": { "class_name": "Zeros", "config": {} }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null },
                    "name": "15",
                    "inbound_nodes": [
                        [
                            ["14", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Activation",
                    "config": { "name": "16", "trainable": true, "dtype": "float32", "activation": "relu" },
                    "name": "16",
                    "inbound_nodes": [
                        [
                            ["15", 0, 0, {}]
                        ]
                    ]
                }, {
                    "class_name": "Dense",
                    "config": { "name": "output_0", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": { "class_name": "Zeros", "config": {} }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null },
                    "name": "output_0",
                    "inbound_nodes": [
                        [
                            ["16", 0, 0, {}]
                        ]
                    ]
                }],
                "input_layers": [
                    ["input_0", 0, 0]
                ],
                "output_layers": [
                    ["output_0", 0, 0]
                ]
            }
        }
    },
    "weightsManifest": [{ "paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{ "name": "12/kernel", "shape": [3, 3, 32, 64], "dtype": "float32" }, { "name": "12/bias", "shape": [64], "dtype": "float32" }, { "name": "15/kernel", "shape": [12544, 256], "dtype": "float32" }, { "name": "15/bias", "shape": [256], "dtype": "float32" }, { "name": "9/kernel", "shape": [3, 3, 1, 32], "dtype": "float32" }, { "name": "9/bias", "shape": [32], "dtype": "float32" }, { "name": "output_0/kernel", "shape": [256, 10], "dtype": "float32" }, { "name": "output_0/bias", "shape": [10], "dtype": "float32" }] }]
}